app/Controllers/Doctor.php

SELECT *
FROM `userdata`
WHERE `position` = 'Pasien'
---
    public function prescription()
    {
        $this->_check_access();
        $db = \Config\Database::connect();

        // Ambil daftar pasien untuk dropdown
        $data['patients'] = $db->table('userdata')
                            ->where('position', 'Pasien')
                            ->get()->getResult();

SELECT *
FROM `userdata`
WHERE `position` = 'Pasien'
---
    public function xray_schedule()
    {
        $this->_check_access();
        $db = \Config\Database::connect();

        // Ambil data pasien
        $data['patients'] = $db->table('userdata')
                            ->where('position', 'Pasien')
                            ->get()->getResult();

SELECT *
FROM `userdata`
WHERE `position` = 'Pasien'
---
    public function xray_request()
    {
        $this->_check_access();
        $db = \Config\Database::connect();

        $data['patients'] = $db->table('userdata')->where('position', 'Pasien')->get()->getResult();

SELECT *
FROM `patient_visits`
WHERE `patient_id` = '13'
ORDER BY `visit_id` DESC
INSERT INTO `xray_requests` (`visit_id`, `patient_id`, `doctor_id`, `xray_id`, `doctor_notes`, `status`, `created_at`) VALUES (0, '13', '6', 1, 'Bagian: Throax | Catatan: a', 'Pending', 1779946881)
---
    public function save_xray_request()
    {
        $db = \Config\Database::connect();
        $patient_id = $this->request->getPost('patient_id');

        // 1. Cari visit_id terakhir pasien ini agar tidak NULL
        $last_visit = $db->table('patient_visits')
                        ->where('patient_id', $patient_id)
                        ->orderBy('visit_id', 'DESC')
                        ->get()->getRow();

        // Jika tidak ada kunjungan, gunakan 0 atau beri pesan error
        $visit_id = $last_visit ? $last_visit->visit_id : 0;

        // 2. Simpan dengan visit_id yang sudah didapat
        $data = [
            'visit_id'     => $visit_id,
            'patient_id'   => $patient_id,
            'doctor_id'    => session()->get('ba_user_id'),
            'xray_id'      => 1, // Pastikan ID 1 ada di tabel xrays
            'doctor_notes' => 'Bagian: ' . $this->request->getPost('body_part') . ' | Catatan: ' . $this->request->getPost('doctor_notes'),
            'status'       => 'Pending',
            'created_at'   => time()
        ];

        if ($db->table('xray_requests')->insert($data)) {