app/Controllers/Drug.php

    public function index($limit = 15, $page = 1)
    {
        // Perbaikan: Pastikan nama model konsisten dengan file yang ada
        $drugsModel = model('DrugsModel');

        // Perbaikan: Gunakan findAll() jika get() tidak didefinisikan di Model
        $data['drugs'] = $drugsModel->findAll();
---
SELECT *
FROM `drugs`