app/Controllers/Patient.php

SELECT `ud`.`user_id`, `ud`.`first_name`, `ud`.`last_name`
FROM `userdata` `ud`
JOIN `user_group` `ug` ON `ug`.`user_id` = `ud`.`user_id`
WHERE `ug`.`group_id` = 3
---
    public function _doctor_list()
    {
        $db = \Config\Database::connect();

        // Ambil semua user yang group_id = 3 (Doctor)
        $doctors = $db->table('userdata ud')
                    ->select('ud.user_id, ud.first_name, ud.last_name')
                    ->join('user_group ug', 'ug.user_id = ud.user_id')
                    ->where('ug.group_id', 3)
                    ->get()
                    ->getResultArray();