app/Controllers/Xray.php

SELECT *
FROM `xrays`
---
    public function index($limit = 15, $page = 1)
    {
        $xraysModel = model('XraysModel'); // Sesuaikan dengan nama file model
        $data['xrays'] = $xraysModel->findAll(); // Gunakan findAll() untuk standar CI4