app/Libraries/Bitauth.php

SELECT *
FROM `logins`
WHERE `ip_address` = 0
AND `success` = 0
ORDER BY `time` DESC
 LIMIT 5
---
    public function locked_out()
    {
        if ($this->_invalid_logins < 1) return FALSE;

        $builder = $this->db->table($this->_table['logins']);
        $query = $builder->where('ip_address', ip2long($this->request->getIPAddress()))
                         ->where('success', 0)
                         ->orderBy('time', 'DESC')
                         ->limit($this->_invalid_logins)
                         ->get();

INSERT INTO `logins` (`ip_address`, `user_id`, `success`, `time`) VALUES (0, '9', 1, '2026-05-17 13:52:17')
---
    public function log_attempt($user_id, $success = FALSE)
    {
        if ($this->_log_logins == TRUE) {
            $data = [
                'ip_address' => ip2long($this->request->getIPAddress()),
                'user_id'    => $user_id,
                'success'    => (int)$success,
                'time'       => $this->timestamp()
            ];
            return $this->db->table($this->_table['logins'])->insert($data);

UPDATE `users` SET `last_login` = '2026-05-17 13:52:17', `last_login_ip` = 0
WHERE `user_id` = '9'
---
    public function update_user($id, $data)
    {
        $data = (array)$data;
        unset($data['user_id'], $data['roles'], $data['id']);

        if (isset($data['groups'])) {
            $groups = $data['groups'];
            unset($data['groups']);
        }

        $userdata = [];
        foreach ($data as $_key => $_val) {
            if (!in_array($_key, $this->_data_fields)) {
                $userdata[$_key] = $_val;
                unset($data[$_key]);
            }
        }

        if (isset($data['password']) && strlen($data['password'])) {
            $data['password'] = $this->hash_password($data['password']);
            $data['password_last_set'] = $this->timestamp();
        } else {
            unset($data['password']);
        }

        $this->db->transStart();

        if (!empty($data)) {
            $this->db->table($this->_table['users'])->where('user_id', $id)->update($data);

SELECT `users`.*, `userdata`.*, GROUP_CONCAT(assoc.group_id SEPARATOR "|") AS groups, BIT_OR(groups.roles) AS roles
FROM `users` `users`
LEFT JOIN `userdata` `userdata` ON `userdata`.`user_id` = `users`.`user_id`
LEFT JOIN `user_group` `assoc` ON `assoc`.`user_id` = `users`.`user_id`
LEFT JOIN `groups` `groups` ON `groups`.`group_id` = `assoc`.`group_id`
GROUP BY `users`.`user_id`
---
    public function get_users($include_disabled = FALSE, $where = [])
    {
        $builder = $this->db->table($this->_table['users'] . ' users');
        $builder->select('users.*, userdata.*, GROUP_CONCAT(assoc.group_id SEPARATOR "|") AS groups, BIT_OR(groups.roles) AS roles')
                ->join($this->_table['data'] . ' userdata', 'userdata.user_id = users.user_id', 'left')
                ->join($this->_table['assoc'] . ' assoc', 'assoc.user_id = users.user_id', 'left')
                ->join($this->_table['groups'] . ' groups', 'groups.group_id = assoc.group_id', 'left')
                ->groupBy('users.user_id');

        if (!$include_disabled) {
            $builder->where('users.enabled', 1);
        }

        // --- TAMBAHAN BARU ---
        // Kalau ada kondisi where, terapkan ke builder
        if (!empty($where)) {
            $builder->where($where);
        }
        // ---------------------

        $query = $builder->get();